---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SolidGeometryOptions
source: html/4dc95230-d3c9-0b35-8203-b41ed4dc8992.htm
---
# SolidGeometryOptions Members

Creates a new SolidOptions class with solid tag settings.